badenwork/hal_nuvoton/dts/pinctrl/m2354kjfae-pinctrl.h
#define PB10MFP_BPWM1_CH1		NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_BPWM1_CH1)
#define PB10MFP_SPI3_SS		NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_SPI3_SS)
#define PB11MFP_GPIO		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_GPIO)
#define PB11MFP_EADC0_CH11		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_EADC0_CH11)
#define PB11MFP_EBI_ADR16		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_EBI_ADR16)
#define PB11MFP_UART4_TXD		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_UART4_TXD)
#define PB11MFP_I2C1_SCL		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_I2C1_SCL)
#define PB11MFP_CAN0_TXD		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_CAN0_TXD)
#define PB11MFP_SPI0_I2SMCLK		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_SPI0_I2SMCLK)
#define PB11MFP_BPWM1_CH0		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_BPWM1_CH0)
#define PB11MFP_SPI3_CLK		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_SPI3_CLK)
#define PB12MFP_GPIO		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_GPIO)
#define PB12MFP_ACMP0_P2		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP0_P2)
#define PB12MFP_ACMP1_P2		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP1_P2)
#define PB12MFP_DAC0_OUT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_DAC0_OUT)
#define PB12MFP_EADC0_CH12		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EADC0_CH12)
#define PB12MFP_EBI_AD15		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EBI_AD15)
#define PB12MFP_SC1_CLK		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SC1_CLK)
#define PB12MFP_SPI0_MOSI		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SPI0_MOSI)
#define PB12MFP_USCI0_CLK		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_USCI0_CLK)
#define PB12MFP_UART0_RXD		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_UART0_RXD)
#define PB12MFP_I2C2_SDA		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_I2C2_SDA)
#define PB12MFP_EPWM1_CH3		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EPWM1_CH3)
#define PB12MFP_TM3_EXT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM3_EXT)
#define PB12MFP_TM5_EXT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM5_EXT)
#define PB13MFP_GPIO		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_GPIO)
#define PB13MFP_ACMP0_P3		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP0_P3)
#define PB13MFP_ACMP1_P3		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP1_P3)
#define PB13MFP_DAC1_OUT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_DAC1_OUT)
#define PB13MFP_EADC0_CH13		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EADC0_CH13)
#define PB13MFP_EBI_AD14		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EBI_AD14)
#define PB13MFP_SC1_DAT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SC1_DAT)
#define PB13MFP_SPI0_MISO		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SPI0_MISO)
#define PB13MFP_USCI0_DAT0		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_USCI0_DAT0)
#define PB13MFP_UART0_TXD		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_UART0_TXD)
#define PB13MFP_I2C2_SCL		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_I2C2_SCL)
#define PB13MFP_EPWM1_CH2		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EPWM1_CH2)
#define PB13MFP_TM2_EXT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM2_EXT)
#define PB13MFP_TM4_EXT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM4_EXT)
#define PB14MFP_GPIO		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_GPIO)
#define PB14MFP_EADC0_CH14		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EADC0_CH14)
#define PB14MFP_EBI_AD13		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EBI_AD13)
#define PB14MFP_SC1_RST		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SC1_RST)
#define PB14MFP_SPI0_CLK		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SPI0_CLK)
#define PB14MFP_USCI0_DAT1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_USCI0_DAT1)
#define PB14MFP_UART3_RXD		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_UART3_RXD)
#define PB14MFP_I2C2_SMBSUS		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_I2C2_SMBSUS)
#define PB14MFP_EPWM0_BRAKE1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EPWM0_BRAKE1)
#define PB14MFP_EPWM1_CH1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EPWM1_CH1)
#define PB14MFP_TM1_EXT		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_TM1_EXT)
#define PB14MFP_CLKO		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_CLKO)
#define PB14MFP_USB_VBUS_ST		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_USB_VBUS_ST)
#define PB15MFP_GPIO		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_GPIO)
#define PB15MFP_EADC0_CH15		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EADC0_CH15)
#define PB15MFP_EBI_AD12		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EBI_AD12)
#define PB15MFP_SC1_PWR		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_SC1_PWR)
#define PB15MFP_SPI0_SS		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_SPI0_SS)
#define PB15MFP_USCI0_CTL1		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_USCI0_CTL1)
#define PB15MFP_UART3_TXD		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_UART3_TXD)
#define PB15MFP_I2C2_SMBAL		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_I2C2_SMBAL)
#define PB15MFP_EPWM1_CH0		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EPWM1_CH0)
#define PB15MFP_TM0_EXT		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_TM0_EXT)
#define PB15MFP_USB_VBUS_EN		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_USB_VBUS_EN)
#define PC0MFP_GPIO		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_GPIO)
#define PC0MFP_EBI_AD0		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_EBI_AD0)
#define PC0MFP_QSPI0_MOSI0		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_QSPI0_MOSI0)
#define PC0MFP_SC1_CLK		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_SC1_CLK)
#define PC0MFP_I2S0_LRCK		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_I2S0_LRCK)
#define PC0MFP_SPI1_SS		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_SPI1_SS)
#define PC0MFP_UART2_RXD		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_UART2_RXD)
#define PC0MFP_I2C0_SDA		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_I2C0_SDA)
#define PC0MFP_EPWM1_CH5		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_EPWM1_CH5)
#define PC0MFP_LCD_COM0		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_LCD_COM0)
#define PC0MFP_ACMP1_O		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_ACMP1_O)
#define PC1MFP_GPIO		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_GPIO)
#define PC1MFP_EBI_AD1		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EBI_AD1)
#define PC1MFP_QSPI0_MISO0		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_QSPI0_MISO0)
#define PC1MFP_SC1_DAT		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_SC1_DAT)
#define PC1MFP_I2S0_DO		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_I2S0_DO)
#define PC1MFP_SPI1_CLK		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_SPI1_CLK)
#define PC1MFP_UART2_TXD		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_UART2_TXD)
#define PC1MFP_I2C0_SCL		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_I2C0_SCL)
#define PC1MFP_EPWM1_CH4		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EPWM1_CH4)
#define PC1MFP_LCD_COM1		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_LCD_COM1)
#define PC1MFP_ACMP0_O		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_ACMP0_O)
#define PC1MFP_EADC0_ST		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EADC0_ST)
#define PC2MFP_GPIO		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_GPIO)
#define PC2MFP_EBI_AD2		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_EBI_AD2)
#define PC2MFP_QSPI0_CLK		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_QSPI0_CLK)
#define PC2MFP_SC1_RST		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_SC1_RST)
#define PC2MFP_I2S0_DI		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_I2S0_DI)
#define PC2MFP_SPI1_MOSI		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_SPI1_MOSI)
#define PC2MFP_I2C0_SMBSUS		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_I2C0_SMBSUS)
#define PC2MFP_UART3_RXD		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_UART3_RXD)
#define PC2MFP_EPWM1_CH3		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_EPWM1_CH3)
#define PC2MFP_LCD_COM2		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_LCD_COM2)
#define PC3MFP_GPIO		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_GPIO)
#define PC3MFP_EBI_AD3		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_EBI_AD3)
#define PC3MFP_QSPI0_SS		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_QSPI0_SS)
#define PC3MFP_SC1_PWR		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_SC1_PWR)
#define PC3MFP_I2S0_MCLK		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_I2S0_MCLK)
#define PC3MFP_SPI1_MISO		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_SPI1_MISO)
#define PC3MFP_I2C0_SMBAL		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_I2C0_SMBAL)
#define PC3MFP_UART3_TXD		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_UART3_TXD)
#define PC3MFP_EPWM1_CH2		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_EPWM1_CH2)
#define PC3MFP_LCD_COM3		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_LCD_COM3)
#define PC4MFP_GPIO		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_GPIO)
#define PC4MFP_EBI_AD4		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_EBI_AD4)
#define PC4MFP_QSPI0_MOSI1		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_QSPI0_MOSI1)
#define PC4MFP_I2S0_BCLK		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_I2S0_BCLK)
#define PC4MFP_SPI1_I2SMCLK		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_SPI1_I2SMCLK)
#define PC4MFP_UART2_RXD		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_UART2_RXD)
#define PC4MFP_I2C1_SDA		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_I2C1_SDA)
#define PC4MFP_CAN0_RXD		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_CAN0_RXD)
#define PC4MFP_UART4_RXD		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_UART4_RXD)
#define PC4MFP_EPWM1_CH1		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_EPWM1_CH1)
#define PC4MFP_LCD_SEG16		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_LCD_SEG16)
#define PC4MFP_LCD_COM4		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_LCD_COM4)
#define PC4MFP_LCD_SEG43		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_LCD_SEG43)
#define PC5MFP_GPIO		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_GPIO)
#define PC5MFP_EBI_AD5		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_EBI_AD5)
#define PC5MFP_QSPI0_MISO1		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_QSPI0_MISO1)
#define PC5MFP_UART2_TXD		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_UART2_TXD)
#define PC5MFP_I2C1_SCL		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_I2C1_SCL)
#define PC5MFP_CAN0_TXD		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_CAN0_TXD)
#define PC5MFP_UART4_TXD		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_UART4_TXD)
#define PC5MFP_EPWM1_CH0		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_EPWM1_CH0)
#define PC5MFP_LCD_SEG15		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_LCD_SEG15)
#define PC5MFP_LCD_COM5		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_LCD_COM5)
#define PC5MFP_LCD_SEG42		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_LCD_SEG42)
#define PC6MFP_GPIO		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_GPIO)
#define PC6MFP_EBI_AD8		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_EBI_AD8)
#define PC6MFP_SPI1_MOSI		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_SPI1_MOSI)
#define PC6MFP_UART4_RXD		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_UART4_RXD)
#define PC6MFP_SC2_RST		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_SC2_RST)
#define PC6MFP_I2C1_SMBSUS		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_I2C1_SMBSUS)
#define PC6MFP_EPWM1_CH3		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_EPWM1_CH3)
#define PC6MFP_BPWM1_CH1		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_BPWM1_CH1)
#define PC6MFP_LCD_SEG9		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_LCD_SEG9)
#define PC6MFP_TM1		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_TM1)
#define PC6MFP_INT2		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_INT2)
#define PC7MFP_GPIO		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_GPIO)
#define PC7MFP_EBI_AD9		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_EBI_AD9)
#define PC7MFP_SPI1_MISO		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_SPI1_MISO)
#define PC7MFP_UART4_TXD		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_UART4_TXD)
#define PC7MFP_SC2_PWR		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_SC2_PWR)
#define PC7MFP_I2C1_SMBAL		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_I2C1_SMBAL)
#define PC7MFP_EPWM1_CH2		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_EPWM1_CH2)
#define PC7MFP_BPWM1_CH0		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_BPWM1_CH0)
#define PC7MFP_LCD_SEG10		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_LCD_SEG10)
#define PC7MFP_TM0		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_TM0)
#define PC7MFP_INT3		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_INT3)
#define PC8MFP_GPIO		NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_GPIO)
#define PC8MFP_EBI_ADR16		NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_EBI_ADR16)
#define PC8MFP_I2C0_SDA		NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_I2C0_SDA)
#define PC8MFP_UART1_RXD		NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_UART1_RXD)
#define PC8MFP_EPWM1_CH1		NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_EPWM1_CH1)
#define PC8MFP_BPWM1_CH4		NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_BPWM1_CH4)
#define PC9MFP_GPIO		NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_GPIO)
#define PC9MFP_EBI_ADR7		NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_EBI_ADR7)
#define PC9MFP_SPI3_SS		NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_SPI3_SS)
#define PC9MFP_UART3_RXD		NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_UART3_RXD)
#define PC9MFP_EPWM1_CH3		NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_EPWM1_CH3)
#define PC10MFP_GPIO		NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_GPIO)
#define PC10MFP_EBI_ADR6		NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_EBI_ADR6)
#define PC10MFP_SPI3_CLK		NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_SPI3_CLK)
#define PC10MFP_UART3_TXD		NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_UART3_TXD)
#define PC10MFP_ECAP1_IC0		NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_ECAP1_IC0)
#define PC10MFP_EPWM1_CH2		NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_EPWM1_CH2)
#define PC11MFP_GPIO		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_GPIO)
#define PC11MFP_EBI_ADR5		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_EBI_ADR5)
#define PC11MFP_UART0_RXD		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_UART0_RXD)
#define PC11MFP_I2C0_SDA		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_I2C0_SDA)
#define PC11MFP_SPI3_MOSI		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_SPI3_MOSI)
#define PC11MFP_ECAP1_IC1		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_ECAP1_IC1)
#define PC11MFP_EPWM1_CH1		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_EPWM1_CH1)
#define PC11MFP_ACMP1_O		NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_ACMP1_O)
#define PC12MFP_GPIO		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_GPIO)
#define PC12MFP_EBI_ADR4		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_EBI_ADR4)
#define PC12MFP_UART0_TXD		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_UART0_TXD)
#define PC12MFP_I2C0_SCL		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_I2C0_SCL)
#define PC12MFP_SPI3_MISO		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_SPI3_MISO)
#define PC12MFP_ECAP1_IC2		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_ECAP1_IC2)
#define PC12MFP_EPWM1_CH0		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_EPWM1_CH0)
#define PC12MFP_ACMP0_O		NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_ACMP0_O)
#define PC13MFP_GPIO		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_GPIO)
#define PC13MFP_EBI_ADR10		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_EBI_ADR10)
#define PC13MFP_SPI2_I2SMCLK		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_SPI2_I2SMCLK)
#define PC13MFP_USCI0_CTL0		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_USCI0_CTL0)
#define PC13MFP_UART2_TXD		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_UART2_TXD)
#define PC13MFP_BPWM0_CH4		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_BPWM0_CH4)
#define PC13MFP_CLKO		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_CLKO)
#define PC13MFP_EADC0_ST		NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_EADC0_ST)
#define PD0MFP_GPIO		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_GPIO)
#define PD0MFP_EBI_AD13		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_EBI_AD13)
#define PD0MFP_USCI0_CLK		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_USCI0_CLK)
#define PD0MFP_SPI0_MOSI		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_SPI0_MOSI)
#define PD0MFP_UART3_RXD		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_UART3_RXD)
#define PD0MFP_I2C2_SDA		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_I2C2_SDA)
#define PD0MFP_SC2_CLK		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_SC2_CLK)
#define PD0MFP_TM2		NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_TM2)
#define PD1MFP_GPIO		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_GPIO)
#define PD1MFP_EBI_AD12		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_EBI_AD12)
#define PD1MFP_USCI0_DAT0		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_USCI0_DAT0)
#define PD1MFP_SPI0_MISO		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_SPI0_MISO)
#define PD1MFP_UART3_TXD		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_UART3_TXD)
#define PD1MFP_I2C2_SCL		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_I2C2_SCL)
#define PD1MFP_SC2_DAT		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_SC2_DAT)
#define PD1MFP_LCD_SEG0		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_LCD_SEG0)
#define PD2MFP_GPIO		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_GPIO)
#define PD2MFP_EBI_AD11		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_EBI_AD11)
#define PD2MFP_USCI0_DAT1		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_USCI0_DAT1)
#define PD2MFP_SPI0_CLK		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_SPI0_CLK)
#define PD2MFP_SC2_RST		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_SC2_RST)
#define PD2MFP_UART0_RXD		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_UART0_RXD)
#define PD2MFP_LCD_SEG1		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_LCD_SEG1)
#define PD3MFP_GPIO		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_GPIO)
#define PD3MFP_EBI_AD10		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_EBI_AD10)
#define PD3MFP_USCI0_CTL1		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_USCI0_CTL1)
#define PD3MFP_SPI0_SS		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_SPI0_SS)
#define PD3MFP_USCI1_CTL0		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_USCI1_CTL0)
#define PD3MFP_SC2_PWR		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_SC2_PWR)
#define PD3MFP_UART0_TXD		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_UART0_TXD)
#define PD3MFP_LCD_SEG2		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_LCD_SEG2)
#define PD4MFP_GPIO		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_GPIO)
#define PD4MFP_USCI0_CTL0		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_USCI0_CTL0)
#define PD4MFP_I2C1_SDA		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_I2C1_SDA)
#define PD4MFP_SPI1_SS		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_SPI1_SS)
#define PD4MFP_USCI1_CTL1		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_USCI1_CTL1)
#define PD4MFP_SC1_CLK		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_SC1_CLK)
#define PD4MFP_USB_VBUS_ST		NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_USB_VBUS_ST)
#define PD5MFP_GPIO		NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_GPIO)
#define PD5MFP_I2C1_SCL		NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_I2C1_SCL)
#define PD5MFP_SPI1_CLK		NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_SPI1_CLK)
#define PD5MFP_USCI1_DAT0		NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_USCI1_DAT0)
#define PD5MFP_SC1_DAT		NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_SC1_DAT)
#define PD6MFP_GPIO		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_GPIO)
#define PD6MFP_UART1_RXD		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_UART1_RXD)
#define PD6MFP_I2C0_SDA		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_I2C0_SDA)
#define PD6MFP_SPI1_MOSI		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_SPI1_MOSI)
#define PD6MFP_USCI1_DAT1		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_USCI1_DAT1)
#define PD6MFP_SC1_RST		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_SC1_RST)
#define PD6MFP_LCD_SEG13		NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_LCD_SEG13)
#define PD7MFP_GPIO		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_GPIO)
#define PD7MFP_UART1_TXD		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_UART1_TXD)
#define PD7MFP_I2C0_SCL		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_I2C0_SCL)
#define PD7MFP_SPI1_MISO		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_SPI1_MISO)
#define PD7MFP_USCI1_CLK		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_USCI1_CLK)
#define PD7MFP_SC1_PWR		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_SC1_PWR)
#define PD7MFP_LCD_SEG14		NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_LCD_SEG14)
#define PD8MFP_GPIO		NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_GPIO)
#define PD8MFP_EBI_AD6		NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_EBI_AD6)
#define PD8MFP_I2C2_SDA		NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_I2C2_SDA)
#define PD8MFP_LCD_COM6		NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_LCD_COM6)
#define PD8MFP_LCD_SEG41		NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_LCD_SEG41)
#define PD9MFP_GPIO		NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_GPIO)
#define PD9MFP_EBI_AD7		NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_EBI_AD7)
#define PD9MFP_I2C2_SCL		NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_I2C2_SCL)
#define PD9MFP_LCD_COM7		NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_LCD_COM7)
#define PD9MFP_LCD_SEG40		NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_LCD_SEG40)
#define PD10MFP_GPIO		NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_GPIO)
#define PD10MFP_UART1_RXD		NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_UART1_RXD)
#define PD10MFP_CAN0_RXD		NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_CAN0_RXD)
#define PD10MFP_QEI0_B		NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_QEI0_B)
#define PD10MFP_INT7		NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_INT7)
#define PD11MFP_GPIO		NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_GPIO)
#define PD11MFP_UART1_TXD		NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_UART1_TXD)
#define PD11MFP_CAN0_TXD		NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_CAN0_TXD)
#define PD11MFP_QEI0_A		NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_QEI0_A)
#define PD11MFP_INT6		NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_INT6)
#define PD12MFP_GPIO		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_GPIO)
#define PD12MFP_UART2_RXD		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_UART2_RXD)
#define PD12MFP_BPWM0_CH5		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_BPWM0_CH5)
#define PD12MFP_QEI0_INDEX		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_QEI0_INDEX)
#define PD12MFP_CLKO		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_CLKO)
#define PD12MFP_EADC0_ST		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_EADC0_ST)
#define PD12MFP_INT5		NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_INT5)
#define PD14MFP_GPIO		NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_GPIO)
#define PD14MFP_SPI3_I2SMCLK		NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_SPI3_I2SMCLK)
#define PD14MFP_USCI0_CTL0		NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_USCI0_CTL0)
#define PD14MFP_SPI0_I2SMCLK		NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_SPI0_I2SMCLK)
#define PD14MFP_EPWM0_CH4		NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_EPWM0_CH4)
#define PD14MFP_LCD_SEG0		NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_LCD_SEG0)
#define PE0MFP_GPIO		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_GPIO)
#define PE0MFP_EBI_AD11		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_EBI_AD11)
#define PE0MFP_QSPI0_MOSI0		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_QSPI0_MOSI0)
#define PE0MFP_SC2_CLK		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_SC2_CLK)
#define PE0MFP_I2S0_MCLK		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_I2S0_MCLK)
#define PE0MFP_SPI1_MOSI		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_SPI1_MOSI)
#define PE0MFP_UART3_RXD		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_UART3_RXD)
#define PE0MFP_I2C1_SDA		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_I2C1_SDA)
#define PE0MFP_LCD_SEG5		NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_LCD_SEG5)
#define PE1MFP_GPIO		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_GPIO)
#define PE1MFP_EBI_AD10		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_EBI_AD10)
#define PE1MFP_QSPI0_MISO0		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_QSPI0_MISO0)
#define PE1MFP_SC2_DAT		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_SC2_DAT)
#define PE1MFP_I2S0_BCLK		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_I2S0_BCLK)
#define PE1MFP_SPI1_MISO		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_SPI1_MISO)
#define PE1MFP_UART3_TXD		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_UART3_TXD)
#define PE1MFP_I2C1_SCL		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_I2C1_SCL)
#define PE1MFP_LCD_SEG6		NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_LCD_SEG6)
#define PE2MFP_GPIO		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_GPIO)
#define PE2MFP_EBI_ALE		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_EBI_ALE)
#define PE2MFP_SD0_DAT0		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_SD0_DAT0)
#define PE2MFP_SPI3_MOSI		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_SPI3_MOSI)
#define PE2MFP_SC0_CLK		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_SC0_CLK)
#define PE2MFP_USCI0_CLK		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_USCI0_CLK)
#define PE2MFP_QEI0_B		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_QEI0_B)
#define PE2MFP_EPWM0_CH5		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_EPWM0_CH5)
#define PE2MFP_BPWM0_CH0		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_BPWM0_CH0)
#define PE2MFP_LCD_SEG7		NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_LCD_SEG7)
#define PE3MFP_GPIO		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_GPIO)
#define PE3MFP_EBI_MCLK		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_EBI_MCLK)
#define PE3MFP_SD0_DAT1		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_SD0_DAT1)
#define PE3MFP_SPI3_MISO		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_SPI3_MISO)
#define PE3MFP_SC0_DAT		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_SC0_DAT)
#define PE3MFP_USCI0_DAT0		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_USCI0_DAT0)
#define PE3MFP_QEI0_A		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_QEI0_A)
#define PE3MFP_EPWM0_CH4		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_EPWM0_CH4)
#define PE3MFP_BPWM0_CH1		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_BPWM0_CH1)
