badenwork/hal_nuvoton/dts/pinctrl/m2354kjfae-pinctrl.h
#define PE3MFP_LCD_SEG8		NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_LCD_SEG8)
#define PE4MFP_GPIO		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_GPIO)
#define PE4MFP_SD0_DAT2		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_SD0_DAT2)
#define PE4MFP_SPI3_CLK		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_SPI3_CLK)
#define PE4MFP_SC0_RST		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_SC0_RST)
#define PE4MFP_USCI0_DAT1		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_USCI0_DAT1)
#define PE4MFP_QEI0_INDEX		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_QEI0_INDEX)
#define PE4MFP_EPWM0_CH3		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_EPWM0_CH3)
#define PE4MFP_BPWM0_CH2		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_BPWM0_CH2)
#define PE4MFP_LCD_SEG9		NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_LCD_SEG9)
#define PE5MFP_GPIO		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_GPIO)
#define PE5MFP_SD0_DAT3		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_SD0_DAT3)
#define PE5MFP_SPI3_SS		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_SPI3_SS)
#define PE5MFP_SC0_PWR		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_SC0_PWR)
#define PE5MFP_USCI0_CTL1		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_USCI0_CTL1)
#define PE5MFP_QEI1_B		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_QEI1_B)
#define PE5MFP_EPWM0_CH2		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_EPWM0_CH2)
#define PE5MFP_BPWM0_CH3		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_BPWM0_CH3)
#define PE5MFP_LCD_SEG10		NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_LCD_SEG10)
#define PE6MFP_GPIO		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_GPIO)
#define PE6MFP_SD0_CLK		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_SD0_CLK)
#define PE6MFP_SPI3_I2SMCLK		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_SPI3_I2SMCLK)
#define PE6MFP_USCI0_CTL0		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_USCI0_CTL0)
#define PE6MFP_UART5_RXD		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_UART5_RXD)
#define PE6MFP_QEI1_A		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_QEI1_A)
#define PE6MFP_EPWM0_CH1		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_EPWM0_CH1)
#define PE6MFP_BPWM0_CH4		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_BPWM0_CH4)
#define PE6MFP_LCD_SEG11		NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_LCD_SEG11)
#define PE7MFP_GPIO		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_GPIO)
#define PE7MFP_SD0_CMD		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_SD0_CMD)
#define PE7MFP_UART5_TXD		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_UART5_TXD)
#define PE7MFP_QEI1_INDEX		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_QEI1_INDEX)
#define PE7MFP_EPWM0_CH0		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_EPWM0_CH0)
#define PE7MFP_BPWM0_CH5		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_BPWM0_CH5)
#define PE7MFP_LCD_SEG12		NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_LCD_SEG12)
#define PE8MFP_GPIO		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_GPIO)
#define PE8MFP_EBI_ADR10		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_EBI_ADR10)
#define PE8MFP_I2S0_BCLK		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_I2S0_BCLK)
#define PE8MFP_SPI2_CLK		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_SPI2_CLK)
#define PE8MFP_USCI1_CTL1		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_USCI1_CTL1)
#define PE8MFP_UART2_TXD		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_UART2_TXD)
#define PE8MFP_EPWM0_CH0		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_EPWM0_CH0)
#define PE8MFP_EPWM0_BRAKE0		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_EPWM0_BRAKE0)
#define PE8MFP_ECAP0_IC0		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_ECAP0_IC0)
#define PE8MFP_TRACE_DATA3		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_TRACE_DATA3)
#define PE8MFP_LCD_SEG32		NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_LCD_SEG32)
#define PE9MFP_GPIO		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_GPIO)
#define PE9MFP_EBI_ADR11		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_EBI_ADR11)
#define PE9MFP_I2S0_MCLK		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_I2S0_MCLK)
#define PE9MFP_SPI2_MISO		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_SPI2_MISO)
#define PE9MFP_USCI1_CTL0		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_USCI1_CTL0)
#define PE9MFP_UART2_RXD		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_UART2_RXD)
#define PE9MFP_EPWM0_CH1		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_EPWM0_CH1)
#define PE9MFP_EPWM0_BRAKE1		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_EPWM0_BRAKE1)
#define PE9MFP_ECAP0_IC1		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_ECAP0_IC1)
#define PE9MFP_TRACE_DATA2		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_TRACE_DATA2)
#define PE9MFP_LCD_SEG31		NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_LCD_SEG31)
#define PE10MFP_GPIO		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_GPIO)
#define PE10MFP_EBI_ADR12		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_EBI_ADR12)
#define PE10MFP_I2S0_DI		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_I2S0_DI)
#define PE10MFP_SPI2_MOSI		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_SPI2_MOSI)
#define PE10MFP_USCI1_DAT0		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_USCI1_DAT0)
#define PE10MFP_UART3_TXD		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_UART3_TXD)
#define PE10MFP_EPWM0_CH2		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_EPWM0_CH2)
#define PE10MFP_EPWM1_BRAKE0		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_EPWM1_BRAKE0)
#define PE10MFP_ECAP0_IC2		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_ECAP0_IC2)
#define PE10MFP_TRACE_DATA1		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_TRACE_DATA1)
#define PE10MFP_LCD_SEG30		NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_LCD_SEG30)
#define PE11MFP_GPIO		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_GPIO)
#define PE11MFP_EBI_ADR13		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_EBI_ADR13)
#define PE11MFP_I2S0_DO		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_I2S0_DO)
#define PE11MFP_SPI2_SS		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_SPI2_SS)
#define PE11MFP_USCI1_DAT1		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_USCI1_DAT1)
#define PE11MFP_UART3_RXD		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_UART3_RXD)
#define PE11MFP_EPWM0_CH3		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_EPWM0_CH3)
#define PE11MFP_EPWM1_BRAKE1		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_EPWM1_BRAKE1)
#define PE11MFP_ECAP1_IC2		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_ECAP1_IC2)
#define PE11MFP_TRACE_DATA0		NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_TRACE_DATA0)
#define PE12MFP_GPIO		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_GPIO)
#define PE12MFP_EBI_ADR14		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_EBI_ADR14)
#define PE12MFP_I2S0_LRCK		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_I2S0_LRCK)
#define PE12MFP_SPI2_I2SMCLK		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_SPI2_I2SMCLK)
#define PE12MFP_USCI1_CLK		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_USCI1_CLK)
#define PE12MFP_EPWM0_CH4		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_EPWM0_CH4)
#define PE12MFP_ECAP1_IC1		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_ECAP1_IC1)
#define PE12MFP_TRACE_CLK		NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_TRACE_CLK)
#define PE13MFP_GPIO		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_GPIO)
#define PE13MFP_EBI_ADR15		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_EBI_ADR15)
#define PE13MFP_I2C0_SCL		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_I2C0_SCL)
#define PE13MFP_UART1_TXD		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_UART1_TXD)
#define PE13MFP_EPWM0_CH5		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_EPWM0_CH5)
#define PE13MFP_EPWM1_CH0		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_EPWM1_CH0)
#define PE13MFP_BPWM1_CH5		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_BPWM1_CH5)
#define PE13MFP_ECAP1_IC0		NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_ECAP1_IC0)
#define PE14MFP_GPIO		NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_GPIO)
#define PE14MFP_EBI_AD8		NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_EBI_AD8)
#define PE14MFP_UART2_TXD		NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_UART2_TXD)
#define PE14MFP_CAN0_TXD		NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_CAN0_TXD)
#define PE14MFP_LCD_SEG23		NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_LCD_SEG23)
#define PE15MFP_GPIO		NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_GPIO)
#define PE15MFP_EBI_AD9		NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_EBI_AD9)
#define PE15MFP_UART2_RXD		NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_UART2_RXD)
#define PE15MFP_CAN0_RXD		NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_CAN0_RXD)
#define PE15MFP_LCD_SEG22		NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_LCD_SEG22)
#define PF0MFP_GPIO		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_GPIO)
#define PF0MFP_UART1_TXD		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_UART1_TXD)
#define PF0MFP_I2C1_SCL		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_I2C1_SCL)
#define PF0MFP_UART0_TXD		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_UART0_TXD)
#define PF0MFP_BPWM1_CH0		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_BPWM1_CH0)
#define PF0MFP_ICE_DAT		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_ICE_DAT)
#define PF1MFP_GPIO		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_GPIO)
#define PF1MFP_UART1_RXD		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_UART1_RXD)
#define PF1MFP_I2C1_SDA		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_I2C1_SDA)
#define PF1MFP_UART0_RXD		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_UART0_RXD)
#define PF1MFP_BPWM1_CH1		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_BPWM1_CH1)
#define PF1MFP_ICE_CLK		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_ICE_CLK)
#define PF2MFP_GPIO		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_GPIO)
#define PF2MFP_UART0_RXD		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_UART0_RXD)
#define PF2MFP_I2C0_SDA		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_I2C0_SDA)
#define PF2MFP_QSPI0_CLK		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_QSPI0_CLK)
#define PF2MFP_XT1_OUT		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_XT1_OUT)
#define PF2MFP_BPWM1_CH1		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_BPWM1_CH1)
#define PF3MFP_GPIO		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_GPIO)
#define PF3MFP_UART0_TXD		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_UART0_TXD)
#define PF3MFP_I2C0_SCL		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_I2C0_SCL)
#define PF3MFP_XT1_IN		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_XT1_IN)
#define PF3MFP_BPWM1_CH0		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_BPWM1_CH0)
#define PF4MFP_GPIO		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_GPIO)
#define PF4MFP_UART2_TXD		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_UART2_TXD)
#define PF4MFP_EPWM0_CH1		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_EPWM0_CH1)
#define PF4MFP_BPWM0_CH5		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_BPWM0_CH5)
#define PF4MFP_X32_OUT		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_X32_OUT)
#define PF5MFP_GPIO		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_GPIO)
#define PF5MFP_UART2_RXD		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_UART2_RXD)
#define PF5MFP_EPWM0_CH0		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_EPWM0_CH0)
#define PF5MFP_BPWM0_CH4		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_BPWM0_CH4)
#define PF5MFP_EPWM0_SYNC_OUT		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_EPWM0_SYNC_OUT)
#define PF5MFP_X32_IN		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_X32_IN)
#define PF5MFP_EADC0_ST		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_EADC0_ST)
#define PF6MFP_GPIO		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_GPIO)
#define PF6MFP_EBI_ADR19		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_EBI_ADR19)
#define PF6MFP_SC0_CLK		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SC0_CLK)
#define PF6MFP_I2S0_LRCK		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_I2S0_LRCK)
#define PF6MFP_SPI0_MOSI		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SPI0_MOSI)
#define PF6MFP_UART4_RXD		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_UART4_RXD)
#define PF6MFP_SPI3_I2SMCLK		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SPI3_I2SMCLK)
#define PF6MFP_TAMPER0		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_TAMPER0)
#define PF7MFP_GPIO		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_GPIO)
#define PF7MFP_EBI_ADR18		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_EBI_ADR18)
#define PF7MFP_SC0_DAT		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_SC0_DAT)
#define PF7MFP_I2S0_DO		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_I2S0_DO)
#define PF7MFP_SPI0_MISO		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_SPI0_MISO)
#define PF7MFP_UART4_TXD		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_UART4_TXD)
#define PF7MFP_TAMPER1		NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_TAMPER1)
#define PF8MFP_GPIO		NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_GPIO)
#define PF8MFP_EBI_ADR17		NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_EBI_ADR17)
#define PF8MFP_SC0_RST		NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_SC0_RST)
#define PF8MFP_I2S0_DI		NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_I2S0_DI)
#define PF8MFP_SPI0_CLK		NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_SPI0_CLK)
#define PF8MFP_TAMPER2		NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_TAMPER2)
#define PF9MFP_GPIO		NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_GPIO)
#define PF9MFP_EBI_ADR16		NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_EBI_ADR16)
#define PF9MFP_SC0_PWR		NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_SC0_PWR)
#define PF9MFP_I2S0_MCLK		NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_I2S0_MCLK)
#define PF9MFP_SPI0_SS		NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_SPI0_SS)
#define PF9MFP_TAMPER3		NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_TAMPER3)
#define PF10MFP_GPIO		NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_GPIO)
#define PF10MFP_EBI_ADR15		NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_EBI_ADR15)
#define PF10MFP_I2S0_BCLK		NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_I2S0_BCLK)
#define PF10MFP_SPI0_I2SMCLK		NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_SPI0_I2SMCLK)
#define PF10MFP_UART5_RXD		NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_UART5_RXD)
#define PF10MFP_TAMPER4		NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_TAMPER4)
#define PF11MFP_GPIO		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_GPIO)
#define PF11MFP_EBI_ADR14		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_EBI_ADR14)
#define PF11MFP_SPI2_MOSI		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_SPI2_MOSI)
#define PF11MFP_UART5_TXD		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_UART5_TXD)
#define PF11MFP_TAMPER5		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_TAMPER5)
#define PF11MFP_TM5		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_TM5)
#define PF11MFP_TM3		NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_TM3)
#define PG2MFP_GPIO		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_GPIO)
#define PG2MFP_EBI_ADR11		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_EBI_ADR11)
#define PG2MFP_SPI2_SS		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_SPI2_SS)
#define PG2MFP_I2C0_SMBAL		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_I2C0_SMBAL)
#define PG2MFP_I2C1_SCL		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_I2C1_SCL)
#define PG2MFP_TM0		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_TM0)
#define PG2MFP_LCD_SEG39		NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_LCD_SEG39)
#define PG3MFP_GPIO		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_GPIO)
#define PG3MFP_EBI_ADR12		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_EBI_ADR12)
#define PG3MFP_SPI2_CLK		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_SPI2_CLK)
#define PG3MFP_I2C0_SMBSUS		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_I2C0_SMBSUS)
#define PG3MFP_I2C1_SDA		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_I2C1_SDA)
#define PG3MFP_TM1		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_TM1)
#define PG3MFP_LCD_SEG38		NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_LCD_SEG38)
#define PG4MFP_GPIO		NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_GPIO)
#define PG4MFP_EBI_ADR13		NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_EBI_ADR13)
#define PG4MFP_SPI2_MISO		NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_SPI2_MISO)
#define PG4MFP_TM4		NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_TM4)
#define PG4MFP_TM2		NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_TM2)
#define PG4MFP_LCD_SEG37		NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_LCD_SEG37)
#define PG9MFP_GPIO		NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_GPIO)
#define PG9MFP_EBI_AD0		NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_EBI_AD0)
#define PG9MFP_BPWM0_CH5		NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_BPWM0_CH5)
#define PG9MFP_LCD_SEG21		NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_LCD_SEG21)
#define PG10MFP_GPIO		NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_GPIO)
#define PG10MFP_EBI_AD1		NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_EBI_AD1)
#define PG10MFP_BPWM0_CH4		NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_BPWM0_CH4)
#define PG10MFP_LCD_SEG20		NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_LCD_SEG20)
#define PG11MFP_GPIO		NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_GPIO)
#define PG11MFP_EBI_AD2		NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_EBI_AD2)
#define PG11MFP_BPWM0_CH3		NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_BPWM0_CH3)
#define PG11MFP_LCD_SEG19		NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_LCD_SEG19)
#define PG12MFP_GPIO		NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_GPIO)
#define PG12MFP_EBI_AD3		NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_EBI_AD3)
#define PG12MFP_BPWM0_CH2		NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_BPWM0_CH2)
#define PG12MFP_LCD_SEG18		NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_LCD_SEG18)
#define PG13MFP_GPIO		NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_GPIO)
#define PG13MFP_EBI_AD4		NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_EBI_AD4)
#define PG13MFP_BPWM0_CH1		NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_BPWM0_CH1)
#define PG13MFP_LCD_SEG17		NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_LCD_SEG17)
#define PG14MFP_GPIO		NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_GPIO)
#define PG14MFP_EBI_AD5		NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_EBI_AD5)
#define PG14MFP_BPWM0_CH0		NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_BPWM0_CH0)
#define PG14MFP_LCD_SEG16		NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_LCD_SEG16)
#define PG15MFP_GPIO		NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_GPIO)
#define PG15MFP_LCD_SEG15		NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_LCD_SEG15)
#define PG15MFP_CLKO		NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_CLKO)
#define PG15MFP_EADC0_ST		NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_EADC0_ST)
#define PH4MFP_GPIO		NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_GPIO)
#define PH4MFP_EBI_ADR3		NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_EBI_ADR3)
#define PH4MFP_SPI1_MISO		NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_SPI1_MISO)
#define PH4MFP_LCD_SEG36		NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_LCD_SEG36)
#define PH5MFP_GPIO		NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_GPIO)
#define PH5MFP_EBI_ADR2		NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_EBI_ADR2)
#define PH5MFP_SPI1_MOSI		NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_SPI1_MOSI)
#define PH5MFP_LCD_SEG35		NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_LCD_SEG35)
#define PH6MFP_GPIO		NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_GPIO)
#define PH6MFP_EBI_ADR1		NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_EBI_ADR1)
#define PH6MFP_SPI1_CLK		NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_SPI1_CLK)
#define PH6MFP_LCD_SEG34		NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_LCD_SEG34)
#define PH7MFP_GPIO		NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_GPIO)
#define PH7MFP_EBI_ADR0		NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_EBI_ADR0)
#define PH7MFP_SPI1_SS		NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_SPI1_SS)
#define PH7MFP_LCD_SEG33		NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_LCD_SEG33)
#define PH8MFP_GPIO		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_GPIO)
#define PH8MFP_EBI_AD12		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_EBI_AD12)
#define PH8MFP_QSPI0_CLK		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_QSPI0_CLK)
#define PH8MFP_SC2_PWR		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_SC2_PWR)
#define PH8MFP_I2S0_DI		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_I2S0_DI)
#define PH8MFP_SPI1_CLK		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_SPI1_CLK)
#define PH8MFP_I2C1_SMBAL		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_I2C1_SMBAL)
#define PH8MFP_I2C2_SCL		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_I2C2_SCL)
#define PH8MFP_UART1_TXD		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_UART1_TXD)
#define PH8MFP_LCD_SEG4		NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_LCD_SEG4)
#define PH9MFP_GPIO		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_GPIO)
#define PH9MFP_EBI_AD13		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_EBI_AD13)
#define PH9MFP_QSPI0_SS		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_QSPI0_SS)
#define PH9MFP_SC2_RST		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_SC2_RST)
#define PH9MFP_I2S0_DO		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_I2S0_DO)
#define PH9MFP_SPI1_SS		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_SPI1_SS)
#define PH9MFP_I2C1_SMBSUS		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_I2C1_SMBSUS)
#define PH9MFP_I2C2_SDA		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_I2C2_SDA)
#define PH9MFP_UART1_RXD		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_UART1_RXD)
#define PH9MFP_LCD_SEG3		NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_LCD_SEG3)
#define PH10MFP_GPIO		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_GPIO)
#define PH10MFP_EBI_AD14		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_EBI_AD14)
#define PH10MFP_QSPI0_MISO1		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_QSPI0_MISO1)
#define PH10MFP_I2S0_LRCK		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_I2S0_LRCK)
#define PH10MFP_SPI1_I2SMCLK		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_SPI1_I2SMCLK)
#define PH10MFP_UART4_TXD		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_UART4_TXD)
#define PH10MFP_UART0_TXD		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_UART0_TXD)
#define PH10MFP_LCD_SEG2		NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_LCD_SEG2)
#define PH11MFP_GPIO		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_GPIO)
#define PH11MFP_EBI_AD15		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_EBI_AD15)
#define PH11MFP_QSPI0_MOSI1		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_QSPI0_MOSI1)
#define PH11MFP_UART4_RXD		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_UART4_RXD)
#define PH11MFP_UART0_RXD		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_UART0_RXD)
#define PH11MFP_EPWM0_CH5		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_EPWM0_CH5)
#define PH11MFP_LCD_SEG1		NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_LCD_SEG1)
